#include <iostream>
//Од тастатура се внесува низа од целобројни елементи А со должина N ( N <= 100). Дополнително се внесува и број К.
// Да се трансформира низата така што на почеток ќе се преместат сите елементи помали од K,
// а после нив ќе следуваат броевите поголеми или еднакви на K. Редоследот на елементите да не се менува.
//
//Испечатете ги елементите на трансформираната низа во еден ред на стандарден излез разделени со празно место.
//
//Пример:
//A[] = {1, 3, 2, 5, 9, 0, 8, 10}, K=6
//Трансформираната низа ќе биде:
//A[] = {1, 3, 2, 5, 0, 9, 8, 10}
//
//A[] = {10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0}, K=6
//Трансформираната низа ќе биде:
//A[] = {5, 4, 3, 2, 1, 0, 10, 9, 8, 7, 6}
//
//A[]={2, 4, 6, 8, 10}, K = 5
//Трансформираната низа ќе биде:
//A[] = {2, 4, 6, 8, 10}
//
//A[]={1, 3, 5, 7, 9} K = 5
//Трансформираната низа ќе биде:
//A[] = {1, 3, 5, 7, 9}

//Input
// 6
// 1 3 5 7 9 0
// 6
//Output
// 1 3 5 0 7 9

//Input
// 6
// 2 4 6 8 10 0
// 6
//Output
// 2 4 6 8 10 0
// 6
// 2 4 0 6 8 10

//Input
// 100
// 2917 3641 -7291 1240 -4930 -1560 9941 744 8532 4530 -8499 8973 4395 7925 -1276 6136 9512 -2107 -6308 3002 -3337 -2469 9935 -10000 -4755 1676 -6424 6919 -8364 -8424 2764 -4459 -5304 1700 4362 2340 -5030 7688 7928 -159 -8638 -8661 7309 5552 3736 3623 -6642 6671 -846 -5201 -8276 46 -7507 -1094 3580 8171 -2725 -6339 747 5839 -4363 7923 812 -1323 608 1893 2630 4192 -6740 -4460 5053 8746 -9738 9414 -2589 -6127 8382 7618 -322 -9554 -4024 -6185 -5925 -1344 -5707 5399 -5836 -9734 9025 1586 -9239 3264 -1745 6578 -4917 -8276 2479 7733 5439 -1158
// 5000
//Output
// 2917 3641 -7291 1240 -4930 -1560 744 4530 -8499 4395 -1276 -2107 -6308 3002 -3337 -2469 -10000 -4755 1676 -6424 -8364 -8424 2764 -4459 -5304 1700 4362 2340 -5030 -159 -8638 -8661 3736 3623 -6642 -846 -5201 -8276 46 -7507 -1094 3580 -2725 -6339 747 -4363 812 -1323 608 1893 2630 4192 -6740 -4460 -9738 -2589 -6127 -322 -9554 -4024 -6185 -5925 -1344 -5707 -5836 -9734 1586 -9239 3264 -1745 -4917 -8276 2479 -1158 9941 8532 8973 7925 6136 9512 9935 6919 7688 7928 7309 5552 6671 8171 5839 7923 5053 8746 9414 8382 7618 5399 9025 6578 7733 5439

using namespace std;

int main() {
    int n;
    cin >> n;
    int array[100];

    for (int i = 0; i < n; i++) {
        cin >> array[i];
    }

    int k;
    cin >> k;

    int result[100];
    int index = 0;

    for (int i = 0; i < n; i++) {
        if (array[i] < k) {
            result[index++] = array[i];
        }
    }

    for (int i = 0; i < n; i++) {
        if (array[i] >= k) {
            result[index++] = array[i];
        }
    }

    for (int i = 0; i < n; i++) {
        cout << result[i] << " ";
    }
    return 0;
}
