#include <iostream>
//Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.
//
//Внесената низа да се трансформира на начин што парните елементи ќе се зголемат за 1, а непарните ќе се намалат за 1.
//
//Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.

//Input
// 5
// 1 2 3 4 5
//Output
// 0 3 2 5 4

using namespace std;

int main() {
    int array[100];
    int n;
    cin >> n;

    for (int i = 0; i < n; i++) {
        cin >> array[i];
    }

    for (int i = 0; i < n; i++) {
        if (array[i] % 2 == 0) {
            array[i]++;
        } else {
            array[i]--;
        }
    }

    for (int i = 0; i < n; i++) {
        cout << array[i] << " ";
    }
    return 0;
}
